using-emacs.org
#+SETUPFILE: ./org-html-themes/org/theme-readtheorg.setup
#+title: Working inside emacs

* Emacs tab

#+begin_quote
How I manually insert tabs inside emacs ?
#+end_quote

Emacs prevents inserting tabs, I think it's because the key is bound to complete when you set the variable =indent-tabs-mode= to nil.

#+begin_quote
Why would you set this variable to nil ?
#+end_quote

This variable permit to complete inside minibuffer or the buffer when you type tab, it's pretty handy as its the default that people are used to from other editors.


#+begin_quote
How to then manually insert your tabs ?
#+end_quote

You can use the key sequence =C-q <tab>= to insert a tab, but electric-mode will cause you some ugly indentation for the next lines.

The second solution is to use the interactive function =tab-to-tab-stop=. It permit to go to the next tab-stop.

I bound this function to the key =C-<tab>= so that I can quickly insert tabs wherever I want :   ~(global-set-key (kbd "C-<tab>") 'tab-to-tab-stop)~


* Merge my linux and mac configuration

#+begin_quote
How to execute a elisp bloc depending on whether you're on mac or linux ?
#+end_quote


The variable =system-type= is set to your current system.

=darwin= for macos and =gnu/linux= for linux.

You just have to use a condition depending on what you want to execute on the current system.

Example :

#+begin_example
  (cond
   ((eq system-type 'darwin)  ;; macOS
    (setq read-process-output-max (* 64 1024)))  ;; 64KB
   ((eq system-type 'gnu/linux)  ;; Linux
    (setq read-process-output-max (* 1024 1024)))  ;; 1MB
   )
#+end_example


#+begin_quote
Do not forget variable like =user-emacs-directory= that helps you and diminishes the use of the conditional statements.
#+end_quote



* Set transparent background

#+begin_quote
How to set transparent background in emacs ?
#+end_quote


To set transparent background in emacs, there are two methods, only one works for each systems (in my experience).

On linux, what worked for me :
#+begin_src emacs-lisp
    (set-frame-parameter nil 'alpha-background 60)
    (add-to-list 'default-frame-alist '(alpha-background . 60))
#+end_src

On mac, what worked :
#+begin_src emacs-lisp
    (set-frame-parameter (selected-frame) 'alpha '(92 . 50))
    (add-to-list 'default-frame-alist '(alpha . (92 . 50))))
#+end_src


* Set up emacs to load pkgs installed from nix

#+begin_quote
How to load the packages that you installed from nix inside emacs ?

We're not talking about binaries, but emacs packages. Such packages should not make modification to any path, unless you want an impure environment.
#+end_quote


** First solution [deprecated]

The first solution, which is the simplest, is to just open a devshell, in which you've installed and initialize the emacs packages. An example for julia environment


#+begin_src nix
{
  description = "Environment to code in Julia";
  
  inputs = {
    nixpkgs.url = "github:nixos/nixpkgs?ref=nixos-unstable";
    flake-utils.url = "github:numtide/flake-utils";
  };

  outputs = { self, nixpkgs, flake-utils }:
    flake-utils.lib.eachDefaultSystem (system:
      let 
        pkgs = import nixpkgs { inherit system; };
      in {
        devShell = pkgs.mkShell {
          nativeBuildInputs = with pkgs; [
            julia-bin
            emacsPackages.julia-ts-mode
            bc
          ];

          shellHook = ''
            julia -e 'import Pkg; Pkg.add("DebugAdapter")' \
            julia -e 'import Pkg; Pkg.add("LanguageServer")' \
            emacs --batch --eval "(progn (package-initialize))" \
            echo "My julia environment for coding"
          '';
        };
      }
    );
}
#+end_src

The packages should be present and loaded after your run `emacs &` in the dev shell.


