using-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-15 Mon 17:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Working inside emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Working inside emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org357cb0c">1. Emacs tab</a></li>
<li><a href="#orga2a0f03">2. Merge my linux and mac configuration</a></li>
<li><a href="#org24357ce">3. Set transparent background</a></li>
<li><a href="#orgd56df64">4. Set up emacs to load pkgs installed from nix</a>
<ul>
<li><a href="#orga4478ff">4.1. First solution [deprecated]</a></li>
<li><a href="#org9a43acd">4.2. Second solution</a></li>
<li><a href="#org83b0d9f">4.3. Third solution</a></li>
</ul>
</li>
<li><a href="#org49549bc">5. How to code per file</a></li>
<li><a href="#org24ac320">6. How to scroll inside vterm</a></li>
<li><a href="#org7888dad">7. How to find then filter down and replace in emacs</a></li>
<li><a href="#org9409116">8. Setting compilation environment variable</a></li>
<li><a href="#org835775b">9. Working with macros</a>
<ul>
<li><a href="#org4019198">9.1. Executing macros with variations</a></li>
<li><a href="#org79c5f37">9.2. Editing macros interactively</a></li>
<li><a href="#orgb7eb927">9.3. Reorganizing macros</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org357cb0c" class="outline-2">
<h2 id="org357cb0c"><span class="section-number-2">1.</span> Emacs tab</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
How I manually insert tabs inside emacs ?
</p>
</blockquote>

<p>
Emacs prevents inserting tabs, I think it's because the key is bound to complete when you set the variable <code>indent-tabs-mode</code> to nil.
</p>

<blockquote>
<p>
Why would you set this variable to nil ?
</p>
</blockquote>

<p>
This variable permit to complete inside minibuffer or the buffer when you type tab, it's pretty handy as its the default that people are used to from other editors.
</p>


<blockquote>
<p>
How to then manually insert your tabs ?
</p>
</blockquote>

<p>
You can use the key sequence <code>C-q &lt;tab&gt;</code> to insert a tab, but electric-mode will cause you some ugly indentation for the next lines.
</p>

<p>
The second solution is to use the interactive function <code>tab-to-tab-stop</code>. It permit to go to the next tab-stop.
</p>

<p>
I bound this function to the key <code>C-&lt;tab&gt;</code> so that I can quickly insert tabs wherever I want :   <code>(global-set-key (kbd "C-&lt;tab&gt;") 'tab-to-tab-stop)</code>
</p>
</div>
</div>
<div id="outline-container-orga2a0f03" class="outline-2">
<h2 id="orga2a0f03"><span class="section-number-2">2.</span> Merge my linux and mac configuration</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
How to execute a elisp bloc depending on whether you're on mac or linux ?
</p>
</blockquote>


<p>
The variable <code>system-type</code> is set to your current system.
</p>

<p>
<code>darwin</code> for macos and <code>gnu/linux</code> for linux.
</p>

<p>
You just have to use a condition depending on what you want to execute on the current system.
</p>

<p>
Example :
</p>

<pre class="example" id="org99f3eaa">
(cond
 ((eq system-type 'darwin)  ;; macOS
  (setq read-process-output-max (* 64 1024)))  ;; 64KB
 ((eq system-type 'gnu/linux)  ;; Linux
  (setq read-process-output-max (* 1024 1024)))  ;; 1MB
 )
</pre>


<blockquote>
<p>
Do not forget variable like <code>user-emacs-directory</code> that helps you and diminishes the use of the conditional statements.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org24357ce" class="outline-2">
<h2 id="org24357ce"><span class="section-number-2">3.</span> Set transparent background</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
How to set transparent background in emacs ?
</p>
</blockquote>


<p>
To set transparent background in emacs, there are two methods, only one works for each systems (in my experience).
</p>

<p>
On linux, what worked for me :
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(set-frame-parameter nil 'alpha-background 60)
(add-to-list 'default-frame-alist '(alpha-background . 60))
</code></pre>
</div>

<p>
On mac, what worked :
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(set-frame-parameter (selected-frame) 'alpha '(92 . 50))
(add-to-list 'default-frame-alist '(alpha . (92 . 50))))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgd56df64" class="outline-2">
<h2 id="orgd56df64"><span class="section-number-2">4.</span> Set up emacs to load pkgs installed from nix</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
How to load the packages that you installed from nix inside emacs ?
</p>

<p>
We're not talking about binaries, but emacs packages. Such packages should not make modification to any path, unless you want an impure environment.
</p>
</blockquote>
</div>
<div id="outline-container-orga4478ff" class="outline-3">
<h3 id="orga4478ff"><span class="section-number-3">4.1.</span> First solution [deprecated]</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The first solution, which is the simplest, is to just open a devshell, in which you've installed and initialize the emacs packages. An example for julia environment
</p>


<div class="org-src-container">
<pre class="src src-nix"><code>{
  description = "Environment to code in Julia";

  inputs = {
    nixpkgs.url = "github:nixos/nixpkgs?ref=nixos-unstable";
    flake-utils.url = "github:numtide/flake-utils";
  };

  outputs = { self, nixpkgs, flake-utils }:
    flake-utils.lib.eachDefaultSystem (system:
      let 
        pkgs = import nixpkgs { inherit system; };
      in {
        devShell = pkgs.mkShell {
          nativeBuildInputs = with pkgs; [
            julia-bin
            emacsPackages.julia-ts-mode
            bc
          ];

          shellHook = ''
            julia -e 'import Pkg; Pkg.add("DebugAdapter")' \
            julia -e 'import Pkg; Pkg.add("LanguageServer")' \
            emacs --batch --eval "(progn (package-initialize))" \
            echo "My julia environment for coding"
          '';
        };
      }
    );
}
</code></pre>
</div>

<p>
The packages should be present and loaded after your run `emacs &amp;` in the dev shell.
</p>
</div>
</div>
