using-emacs.org
** Second solution

#+begin_quote
Why bother with this second solution ?

While building the dev environment using nix, the first solution demands to quit emacs, make your changes and reload emacs to check if all is correctly setup. That was such a pain that I decided to find a solution. (I hate doing the same things in repitition)
#+end_quote


The second solution involves using packages like =envrc= (the one I use) or =direnv= (an alternative).

I use [[https://github.com/purcell/envrc][envrc]] becauses it loaded the variables from direnv at a buffer level instead of inserting them to emacs global state.

My configuration looks like :

#+begin_src emacs-lisp
(use-package envrc
    :config
    (envrc-global-mode))
#+end_src


For this to work, you should have the direnv binary, an =.envrc= file inside your root dir, and had allowed direnv to automatically load your shell environment. Details here :  [[https://nix.dev/guides/recipes/direnv.html][nix direnv workflow]] and [[https://direnv.net/][direnv documentation]]

 The fact is, with this method, the binary will be inside the path of emacs and you'll be able to use them, but not the emacsPackages, because the load-path will not gets populate with those packages root directories.

The workaround I found for this is to add those directories to the load path with some elisp code. Here is my custom function that does that :


#+begin_src emacs-lisp
(defun smv/add-nix-pkg-to-lpath (PKG_ENV)
    "Load the PKG_ENV directory to the load path of current emacs session
    it permits to then require the package"
    
    (let ((pkg-nix-path (getenv PKG_ENV)))

      (unless pkg-nix-path
        (user-error "Environment variable '%s' is not set" PKG_ENV))

      (let ((pkg-suffix "/share/emacs/site-lisp/elpa/"))
        
        (string-match "-emacs-\\([^/]+\\)" pkg-nix-path)
        
        (let* ((pkg-full-path (match-string 1 pkg-nix-path))
               (path-to-add (concat pkg-nix-path pkg-suffix pkg-full-path)))
          (unless (member path-to-add load-path)
            (add-to-list 'load-path path-to-add))))))
#+end_src


Depending on some environment variable it add the "/share/emacs/site-elisp/elpa/<package-name>" directory of this environment variable to the load path.

The required environment variable here is the nix-path of the package you want to load.

How I use it ?

#+begin_src nix
    {
      ...
            devShell = pkgs.mkShell {
              nativeBuildInputs = with pkgs; [
                julia-bin
                emacsPackages.julia-ts-mode
                bc
              ];

              shellHook = ''
                export EMACS_JULIATS = "${pkgs.emacsPackages.julia-ts-mode}"
                echo "My julia environment for coding"
              '';
            };
          
       ...
    }
#+end_src

Look at the =shellHook= bloc, I've defined a shell environment variable that will be buffer available when envrc will run direnv.

Then you can call my custom function using this variable as an argument. For example :

~(smv/add-nix-pkg-to-lpath EMACS_JULIATS)~

You can add such call to your .dir-locals.el file inside the root directory of your project and that's it.







** Third solution

The last solution involves [[https://www.jetify.com/docs/devbox/installing-devbox][devbox]], it's a wrapper around nix that you could use without knowing the nix language. It's pretty cool if you only use nix as an dev environment manager.

After the initialization of devbox in your project, you should generate the direnv file : [[https://www.jetify.com/docs/devbox/ide-configuration/direnv][generate direnv]]

The approach here will be to take advantage of the environment variable [[https://emacsdocs.org/docs/elisp/Library-Search][EMACSLOADPATH]]. This variable is used to build the load-path at emacs' start.

I wrote this script that you could add to your devbox init_hook, such that it's ran when you enter the shell.

#+begin_src shell
  EMACS_LOAD_PATHS=''
  for pkg in $(printenv buildInputs | tr ' ' '\\n' | grep -E 'emacs.*-mode');
  do
      PKG_NAME=$(basename $pkg | awk -F- '{ printf "%s-%s", $3, $4 }')
      PKG_VERSION=$(devbox info emacsPackages.$PKG_NAME 2>/dev/null | awk '{print $2}' || echo '')
      if [ -n "$PKG_VERSION" ]; then
  	EMACS_LOAD_PATHS="$pkg/share/emacs/site-lisp/elpa/$PKG_NAME-$PKG_VERSION:$EMACS_LOAD_PATHS"
      fi
  done
  export EMACSLOADPATH="$EMACS_LOAD_PATHS$EMACSLOADPATH"
  echo "✓ Emacs packages loaded"
#+end_src

To be able to do that in the most efficient way, what I've done, is just to create a new snippet that contains this code snippet.

This command will go through the packages that you've added and add the emacs' ones to the environment variable EMACSLOADPATH.

At this point of time running emacs in the devshell created by devbox should permit to get the emacs packages. We should now make it such that the same thing is done even in the current instance of emacs.

At the time of writing this I use =direnv-mode= now.
With direnv-mode, I can run the interactive command =direnv-update-environment= and that will run direnv and inject the variables into the emacs' global variables list.
So the thing to do is just to advice after this command. This will permit to add the paths to the load-path.
I've written this code snippet that you can add to your configuration :

#+begin_src emacs-lisp
  (with-eval-after-load 'direnv
    (advice-add 'direnv-update-environment :after
                (lambda (&rest _)
  		(when (getenv "EMACSLOADPATH")
                    (let ((paths (split-string (getenv "EMACSLOADPATH") ":")))
                      (dolist (path (reverse paths))
                        (add-to-list 'load-path path)))))))
#+end_src


And that is it. Running =direnv-update-environment= will also add the paths in EMACSLOADPATH to the current load-path of emacs.

* How to code per file

This notes that I take requires me to modify my index.html file each time. I could've use a command to trigger the modification automatically. But the solution that came up first into my mind was to create a snippet that will only be available in that file. This way I can open my file add my new entry and that's it.

To execute some code on a directory level in emacs you could use a file called =.dir-locals.el=, to execute code in a per-file basis you use a ~;; -*- eval: <code> ; -*-~ on top of that file.

eval means evaluate, you could set others things, such as the mode, with =mode= like ~mode: lisp~ for example.

So here's what I wrote on top on my file, it uses the =auto-yasnippet='s package variable =aya-current=  :

~;; -*- eval: (progn (setq aya-current "<li><a href=\"${1:org-file-name}.html\">${2:title}</a></li>")); -*-~


* How to scroll inside vterm

vterm has multiple mode, it's not like eshell that permits you to scroll without restriction inside the terminal.

In vterm, you should switch to the copy-mode to be able to scroll inside the terminal.

The default binding for that is : ~C-c C-t~


