using-emacs.html
<div id="outline-container-org9a43acd" class="outline-3">
<h3 id="org9a43acd"><span class="section-number-3">4.2.</span> Second solution</h3>
<div class="outline-text-3" id="text-4-2">
<blockquote>
<p>
Why bother with this second solution ?
</p>

<p>
While building the dev environment using nix, the first solution demands to quit emacs, make your changes and reload emacs to check if all is correctly setup. That was such a pain that I decided to find a solution. (I hate doing the same things in repitition)
</p>
</blockquote>


<p>
The second solution involves using packages like <code>envrc</code> (the one I use) or <code>direnv</code> (an alternative).
</p>

<p>
I use <a href="https://github.com/purcell/envrc">envrc</a> becauses it loaded the variables from direnv at a buffer level instead of inserting them to emacs global state.
</p>

<p>
My configuration looks like :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(use-package envrc
    :config
    (envrc-global-mode))
</code></pre>
</div>


<p>
For this to work, you should have the direnv binary, an <code>.envrc</code> file inside your root dir, and had allowed direnv to automatically load your shell environment. Details here :  <a href="https://nix.dev/guides/recipes/direnv.html">nix direnv workflow</a> and <a href="https://direnv.net/">direnv documentation</a>
</p>

<p>
The fact is, with this method, the binary will be inside the path of emacs and you'll be able to use them, but not the emacsPackages, because the load-path will not gets populate with those packages root directories.
</p>

<p>
The workaround I found for this is to add those directories to the load path with some elisp code. Here is my custom function that does that :
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(defun smv/add-nix-pkg-to-lpath (PKG_ENV)
    "Load the PKG_ENV directory to the load path of current emacs session
    it permits to then require the package"

    (let ((pkg-nix-path (getenv PKG_ENV)))

      (unless pkg-nix-path
        (user-error "Environment variable '%s' is not set" PKG_ENV))

      (let ((pkg-suffix "/share/emacs/site-lisp/elpa/"))

        (string-match "-emacs-\\([^/]+\\)" pkg-nix-path)

        (let* ((pkg-full-path (match-string 1 pkg-nix-path))
               (path-to-add (concat pkg-nix-path pkg-suffix pkg-full-path)))
          (unless (member path-to-add load-path)
            (add-to-list 'load-path path-to-add))))))
</code></pre>
</div>


<p>
Depending on some environment variable it add the "/share/emacs/site-elisp/elpa/&lt;package-name&gt;" directory of this environment variable to the load path.
</p>

<p>
The required environment variable here is the nix-path of the package you want to load.
</p>

<p>
How I use it ?
</p>

<div class="org-src-container">
<pre class="src src-nix"><code>{
  ...
        devShell = pkgs.mkShell {
          nativeBuildInputs = with pkgs; [
            julia-bin
            emacsPackages.julia-ts-mode
            bc
          ];

          shellHook = ''
            export EMACS_JULIATS = "${pkgs.emacsPackages.julia-ts-mode}"
            echo "My julia environment for coding"
          '';
        };

   ...
}
</code></pre>
</div>

<p>
Look at the <code>shellHook</code> bloc, I've defined a shell environment variable that will be buffer available when envrc will run direnv.
</p>

<p>
Then you can call my custom function using this variable as an argument. For example :
</p>

<p>
<code>(smv/add-nix-pkg-to-lpath EMACS_JULIATS)</code>
</p>

<p>
You can add such call to your .dir-locals.el file inside the root directory of your project and that's it.
</p>
</div>
</div>
<div id="outline-container-org83b0d9f" class="outline-3">
<h3 id="org83b0d9f"><span class="section-number-3">4.3.</span> Third solution</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The last solution involves <a href="https://www.jetify.com/docs/devbox/installing-devbox">devbox</a>, it's a wrapper around nix that you could use without knowing the nix language. It's pretty cool if you only use nix as an dev environment manager.
</p>

<p>
After the initialization of devbox in your project, you should generate the direnv file : <a href="https://www.jetify.com/docs/devbox/ide-configuration/direnv">generate direnv</a>
</p>

<p>
The approach here will be to take advantage of the environment variable <a href="https://emacsdocs.org/docs/elisp/Library-Search">EMACSLOADPATH</a>. This variable is used to build the load-path at emacs' start.
</p>

<p>
I wrote this script that you could add to your devbox init<sub>hook</sub>, such that it's ran when you enter the shell.
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>EMACS_LOAD_PATHS=''
for pkg in $(printenv buildInputs | tr ' ' '\\n' | grep -E 'emacs.*-mode');
do
    PKG_NAME=$(basename $pkg | awk -F- '{ printf "%s-%s", $3, $4 }')
    PKG_VERSION=$(devbox info emacsPackages.$PKG_NAME 2&gt;/dev/null | awk '{print $2}' || echo '')
    if [ -n "$PKG_VERSION" ]; then
        EMACS_LOAD_PATHS="$pkg/share/emacs/site-lisp/elpa/$PKG_NAME-$PKG_VERSION:$EMACS_LOAD_PATHS"
    fi
done
export EMACSLOADPATH="$EMACS_LOAD_PATHS$EMACSLOADPATH"
echo "✓ Emacs packages loaded"
</code></pre>
</div>

<p>
To be able to do that in the most efficient way, what I've done, is just to create a new snippet that contains this code snippet.
</p>

<p>
This command will go through the packages that you've added and add the emacs' ones to the environment variable EMACSLOADPATH.
</p>

<p>
At this point of time running emacs in the devshell created by devbox should permit to get the emacs packages. We should now make it such that the same thing is done even in the current instance of emacs.
</p>

<p>
At the time of writing this I use <code>direnv-mode</code> now.
With direnv-mode, I can run the interactive command <code>direnv-update-environment</code> and that will run direnv and inject the variables into the emacs' global variables list.
So the thing to do is just to advice after this command. This will permit to add the paths to the load-path.
I've written this code snippet that you can add to your configuration :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(with-eval-after-load 'direnv
  (advice-add 'direnv-update-environment :after
              (lambda (&amp;rest _)
                (when (getenv "EMACSLOADPATH")
                  (let ((paths (split-string (getenv "EMACSLOADPATH") ":")))
                    (dolist (path (reverse paths))
                      (add-to-list 'load-path path)))))))
</code></pre>
</div>


<p>
And that is it. Running <code>direnv-update-environment</code> will also add the paths in EMACSLOADPATH to the current load-path of emacs.
</p>
</div>
</div>
</div>
<div id="outline-container-org49549bc" class="outline-2">
<h2 id="org49549bc"><span class="section-number-2">5.</span> How to code per file</h2>
<div class="outline-text-2" id="text-5">
<p>
This notes that I take requires me to modify my index.html file each time. I could've use a command to trigger the modification automatically. But the solution that came up first into my mind was to create a snippet that will only be available in that file. This way I can open my file add my new entry and that's it.
</p>

<p>
To execute some code on a directory level in emacs you could use a file called <code>.dir-locals.el</code>, to execute code in a per-file basis you use a <code>;; -*- eval: &lt;code&gt; ; -*-</code> on top of that file.
</p>

<p>
eval means evaluate, you could set others things, such as the mode, with <code>mode</code> like <code>mode: lisp</code> for example.
</p>

<p>
So here's what I wrote on top on my file, it uses the <code>auto-yasnippet</code>'s package variable <code>aya-current</code>  :
</p>

<p>
<code>;; -*- eval: (progn (setq aya-current "&lt;li&gt;&lt;a href=\"${1:org-file-name}.html\"&gt;${2:title}&lt;/a&gt;&lt;/li&gt;")); -*-</code>
</p>
</div>
</div>
<div id="outline-container-org24ac320" class="outline-2">
<h2 id="org24ac320"><span class="section-number-2">6.</span> How to scroll inside vterm</h2>
<div class="outline-text-2" id="text-6">
<p>
vterm has multiple mode, it's not like eshell that permits you to scroll without restriction inside the terminal.
</p>

<p>
In vterm, you should switch to the copy-mode to be able to scroll inside the terminal.
</p>

<p>
The default binding for that is : <code>C-c C-t</code>
</p>
</div>
</div>
