using-emacs.org
* How to find then filter down and replace in emacs

You can find patterns in folders in Emacs using `find-grep`, `find-grep-dired` (which will only show the file names inside a dired buffer), `rgrep`, and similar commands. All of these will open a grep buffer that utilizes `compilation-mode` bindings.

#+begin_quote
How to filter the results and then perform replacements ?
#+end_quote

You can make the grep buffer read-only using `C-x C-q` (which runs `toggle-read-only`) and then use commands like `keep-lines` or `flush-lines` to filter the results. Alternatively, you can manually remove the lines you don't want from the list.

Once you have your desired selection, switch to `wgrep` mode (`wgrep-change-to-wgrep-mode`) to perform operations on the occurrences.


* Setting compilation environment variable

When you're coding inside emacs you might want to run some commands using the project-compile command, which is really powerfull.
Sometimes you might want to set some compilation environment that is only needed during this command evaluation process, you don't need that variable outside. For example you might want to add some path to the PYTHONPATH for your project to correctly run.

To set those kind of commands, pay attention to the fact that using the "$PYTHONPATH" formula will not work. Prefer setting the environment by retrieving the variable value then add the new string to it.

What I mean is :

Prefer : ~(setq compilation-environment (list (concat "PYTHONPATH=" (getenv "PYTHONPATH") ":" (expand-file-name "./src"))))~ or ~(setq compilation-environment (list (concat "PYTHONPATH=" (getenv "PYTHONPATH") ":./src")))~

instead of : ~(setq compilation-environment '("PYTHONPATH=$PYTHONPATH:./src"))~



* Working with macros


** Executing macros with variations

While recording macros, you can use the command =C-x q= to stop at some point.
This command when you type it in the macro will not do anything but when you will play back the macro emacs will ask you wheter you want to continue the macro or not.
To this question you can answer =C-r= which will make emacs enter in a recursive edit mode where you can do things outside of the macro, like typing a particular piece of text.
After you've finished, you can type =C-M-c= to leave that recursive state and you will be prompted whether or not you want the macro to continue its execution.

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macro-Query.html][The documentation for what I've explained]]


*** Editing macros interactively

You can edit macros interactively, meaning while playing it.
The shortcut for that is : =C-x C-k SPC=

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macro-Step_002dEdit.html][stepwise editing macros]]

