using-emacs.html
<div id="outline-container-org7888dad" class="outline-2">
<h2 id="org7888dad"><span class="section-number-2">7.</span> How to find then filter down and replace in emacs</h2>
<div class="outline-text-2" id="text-7">
<p>
You can find patterns in folders in Emacs using `find-grep`, `find-grep-dired` (which will only show the file names inside a dired buffer), `rgrep`, and similar commands. All of these will open a grep buffer that utilizes `compilation-mode` bindings.
</p>

<blockquote>
<p>
How to filter the results and then perform replacements ?
</p>
</blockquote>

<p>
You can make the grep buffer read-only using `C-x C-q` (which runs `toggle-read-only`) and then use commands like `keep-lines` or `flush-lines` to filter the results. Alternatively, you can manually remove the lines you don't want from the list.
</p>

<p>
Once you have your desired selection, switch to `wgrep` mode (`wgrep-change-to-wgrep-mode`) to perform operations on the occurrences.
</p>
</div>
</div>
<div id="outline-container-org9409116" class="outline-2">
<h2 id="org9409116"><span class="section-number-2">8.</span> Setting compilation environment variable</h2>
<div class="outline-text-2" id="text-8">
<p>
When you're coding inside emacs you might want to run some commands using the project-compile command, which is really powerfull.
Sometimes you might want to set some compilation environment that is only needed during this command evaluation process, you don't need that variable outside. For example you might want to add some path to the PYTHONPATH for your project to correctly run.
</p>

<p>
To set those kind of commands, pay attention to the fact that using the "$PYTHONPATH" formula will not work. Prefer setting the environment by retrieving the variable value then add the new string to it.
</p>

<p>
What I mean is :
</p>

<p>
Prefer : <code>(setq compilation-environment (list (concat "PYTHONPATH=" (getenv "PYTHONPATH") ":" (expand-file-name "./src"))))</code> or <code>(setq compilation-environment (list (concat "PYTHONPATH=" (getenv "PYTHONPATH") ":./src")))</code>
</p>

<p>
instead of : <code>(setq compilation-environment '("PYTHONPATH=$PYTHONPATH:./src"))</code>
</p>
</div>
</div>
<div id="outline-container-org835775b" class="outline-2">
<h2 id="org835775b"><span class="section-number-2">9.</span> Working with macros</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org4019198" class="outline-3">
<h3 id="org4019198"><span class="section-number-3">9.1.</span> Executing macros with variations</h3>
<div class="outline-text-3" id="text-9-1">
<p>
While recording macros, you can use the command <code>C-x q</code> to stop at some point.
This command when you type it in the macro will not do anything but when you will play back the macro emacs will ask you wheter you want to continue the macro or not.
To this question you can answer <code>C-r</code> which will make emacs enter in a recursive edit mode where you can do things outside of the macro, like typing a particular piece of text.
After you've finished, you can type <code>C-M-c</code> to leave that recursive state and you will be prompted whether or not you want the macro to continue its execution.
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macro-Query.html">The documentation for what I've explained</a>
</p>
</div>
</div>
<div id="outline-container-org79c5f37" class="outline-3">
<h3 id="org79c5f37"><span class="section-number-3">9.2.</span> Editing macros interactively</h3>
<div class="outline-text-3" id="text-9-2">
<p>
You can edit macros interactively, meaning while playing it.
The shortcut for that is : <code>C-x C-k SPC</code>
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macro-Step_002dEdit.html">stepwise editing macros</a>
</p>
</div>
</div>
<div id="outline-container-orgb7eb927" class="outline-3">
<h3 id="orgb7eb927"><span class="section-number-3">9.3.</span> Reorganizing macros</h3>
<div class="outline-text-3" id="text-9-3">
<p>
You can reorganize the macros' kill ring.
Start by listing them with : <code>list-keyboard-macros</code> and here it's you can modify them
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-12-15 Mon 17:20</p>
</div>
</body>
</html>
